**** Ejemplo 2 Elemental previo al Ejemplo 2- Operaciones sobre un Array
     #+BEGIN_SRC js :results output
       const valores = ['1', '2', 'foo', '3', '4'];

       let resultado = valores
           .map(x => parseInt(x))
           .filter(x => !isNaN(x))
           .reduce((semilla, siguiente) => semilla + siguiente);

       console.log(resultado);
     #+END_SRC

     #+RESULTS:
     : 10
